Revit 2024 API
HemisphericalLightDistribution Constructor
 Creates a hemispherical light distribution object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public HemisphericalLightDistribution()
Visual Basic
Public Sub New
Visual C++
public:
HemisphericalLightDistribution()
See Also
HemisphericalLightDistribution Class
HemisphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace